using System;

namespace project
{
    class Program
    {
        static void Main()
        {
            string name;
            int x;
            float hp;

            hp = float.Parse(Console.ReadLine());


            Console.WriteLine("Добро пожаловать в безумную космическую станцию!");
            Console.WriteLine("Покажите свой пропуск тестировщика.");
            Console.Write("Имя тестировщика: ");
            name = Console.ReadLine();
            Console.WriteLine("");
            Console.WriteLine("Отлично! Пользователь: " + name + " готов к прохождению станции!");
            Console.WriteLine("Нажмите любую клавишу для продолжения");
            Console.ReadKey();
            Console.WriteLine("Перед вами три двери шлюзов станции. Вы патлись прислушаться нет ли каких нибудь звуков за стальными дверьми, но там сплошная тишина.");
            Console.WriteLine("Какую дверь вы откроете и войдете?");
            Console.WriteLine("Первая дверь [1]. Вторая дверь [2]. Третья дверь [3].");
            x = Convert.ToInt32(Console.ReadLine());
            // ветка 1
            if (x == 1 )
            {
                Console.WriteLine(name + "Открыл первую дверь, перед тобой темный и холодный стальной коридор, по бокам видно открытые двери в каюты.");
                Console.WriteLine("Проходя по коридоры ты то и дело бросал быстро взгляды в открыте комнаты, что бы найти что то полезное");
                Console.WriteLine("Пройти по коридору дальше [1]. Зайти в последнюю открытую комнату [2]");
                x = Convert.ToInt32(Console.ReadLine());
                // ветка 1.1
                if ( x == 1)
                {
                    Console.WriteLine("Пройдя дальше по коридору ты выходишь в огромную комнату, похоже это паб станции.");
                    Console.WriteLine("Простояв минут 5 и наблюдая за этой комнатой, ты услышал что из соседнего коридора станции доносятся тихий приглушенные шаги");
                    Console.WriteLine("Спрятаться за угол и наблюдать [1]. Пробежать к лестнице ведующей на второй этаж [2].");
                    x = Convert.ToInt32(Console.ReadLine());
                    // ветка 1.1.1 (концовка 1)
                    if ( x == 1)
                    {
                        Console.WriteLine("Подождав и наблюдая за углом, через минут 10 из темноты коридора вышел боевой-мех солдат.");
                        Console.WriteLine("Сразу же выйдя из коридора, из головы мех-солдата излучились зеленные лучи состовляющие сетку, которая прошла по всей комнате");
                        Console.WriteLine("Сетка так же прошла и по тебе");
                        Console.WriteLine("Не успев понять, мех-солдат уже смотрит на тебя, через мгновение ты понимаешь, что в груди дыра от его оружия.");
                        Console.WriteLine("Концовка [1] - Смерть.");
                    }
                    // ветка 1.2
                    else if( x == 2)
                    {   
                    Console.WriteLine("Пробегая комноту, ты сразу перепрыгиваешь несколько ступенек, и кинув взгляд назад, через пила ты увидел некое зеленное свечение");
                    Console.WriteLine("Ты понимаешь, что дела обстоят не в твою сторону, поэтому пробегая дальше, ты заходишь на второй этаж");
                    Console.WriteLine("Похоже это огромная столовка. Ты видишь что прямо есть огромные двойные двери, они поломанные но приоткрытые.");
                    Console.WriteLine("Добежать до двери и постараться протиснуться [1]. Перепрыгнуть стол выдачи еды и найти другой выход [2].");
                    x = Convert.ToInt32(Console.ReadLine());
                        if( x == 1)
                         {
                        Console.WriteLine("Добежав до двери ты стараешься протиснуться, и вдруг у тебя это выходит!");
                        Console.WriteLine("Только вот что-то не так. Как-то ты резко легко протиснулся.");
                        Console.WriteLine("Посмотрев назад, в щели двери в далеке у лестницы видишь мех-солдата");
                        Console.WriteLine("До тебя резко доходит боль и првда одновременно, мех-солдат успел выстрелить в тебя тем самым выстрелом, отрубил тебе руку и часть тела");
                        Console.WriteLine("Концовка [1] - Смерть.");
                         }
                    }
                }
                
            }



        }
    }
}